Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAG169.atdf
      <value-group caption="Voltage Reference Input Selection bits" name="ADCCON3__VREFSEL">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="External VREFH and External VREFL" name="" value="0x3" />
         <value caption="AVDD and External VREFL" name="" value="0x2" />
         <value caption="External VREFH and AVSS" name="" value="0x1" />
         <value caption="External AVDD and AVSS" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Digital Enable bit" name="ADCCON3__DIGEN0">
         <value caption="ADC0 is digital enabled" name="" value="0x1" />
         <value caption="ADC0 is digital disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Digital Enable bit" name="ADCCON3__DIGEN1">
         <value caption="ADC1 is digital enabled" name="" value="0x1" />
         <value caption="ADC1 is digital disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC2 Digital Enable bit" name="ADCCON3__DIGEN2">
         <value caption="ADC2 is digital enabled" name="" value="0x1" />
         <value caption="ADC2 is digital disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC3 Digital Enable bit" name="ADCCON3__DIGEN3">
         <value caption="ADC3 is digital enabled" name="" value="0x1" />
         <value caption="ADC3 is digital disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC4 Digital Enable bit" name="ADCCON3__DIGEN4">
         <value caption="ADC4 is digital enabled" name="" value="0x1" />
         <value caption="ADC4 is digital disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Digital Enable bit" name="ADCCON3__DIGEN7">
         <value caption="ADC7 is digital enabled" name="" value="0x1" />
         <value caption="ADC7 is digital disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog-to-Digital Control Clock Divider bits" name="ADCCON3__CONCLKDIV">
         <value caption="64 * Tclk = Tq" name="" value="0x3f" />
         <value caption="4 * Tclk = Tq" name="" value="0x3" />
         <value caption="3 * Tclk = Tq" name="" value="0x2" />
         <value caption="2 * Tclk = Tq" name="" value="0x1" />
         <value caption="Tclk = Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog-to-Digital Clock Source bits" name="ADCCON3__ADCSEL">
         <value caption="FRC" name="" value="0x3" />
         <value caption="REFCLK3" name="" value="0x2" />
         <value caption="System Clock (Tcy)" name="" value="0x1" />
         <value caption="PBCLK3" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN0">
         <value caption="ADC0 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC0 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN1">
         <value caption="ADC1 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC1 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC2Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN2">
         <value caption="ADC2 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC2 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC3 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN3">
         <value caption="ADC3 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC3 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC4 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN4">
         <value caption="ADC4 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC4 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN0">
         <value caption="ADC0 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC0 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN1">
         <value caption="ADC1 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC1 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC2 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN2">
         <value caption="ADC2 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC2 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC3 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN3">
         <value caption="ADC3 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC3 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC4 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN4">
         <value caption="ADC4 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC4 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Analog Input Select bit" name="ADCTRGMODE__SH0ALT">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="AN45" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
