Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAG169.atdf
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits (1)" name="PRISS__PRI1SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits (1)" name="PRISS__PRI2SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits (1)" name="PRISS__PRI3SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits (1)" name="PRISS__PRI4SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
